Revit 2026 API

# DocumentNewFamilyInstance(Curve, FamilySymbol, Level, StructuralType) Method

---

Inserts a new instance of a family into the document, using a curve, type/symbol and reference level.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyInstance NewFamilyInstance(
	Curve curve,
	FamilySymbol symbol,
	Level level,
	StructuralType structuralType
)
```
```vb
Public Function NewFamilyInstance (
	curve As Curve,
	symbol As FamilySymbol,
	level As Level,
	structuralType As StructuralType
) As FamilyInstance
```
```cpp
public:
FamilyInstance^ NewFamilyInstance(
	Curve^ curve,
	FamilySymbol^ symbol,
	Level^ level,
	StructuralType structuralType
)
```
```fsharp
member NewFamilyInstance :
        curve : Curve *
        symbol : FamilySymbol *
        level : Level *
        structuralType : StructuralType -> FamilyInstance
```

#### Parameters

curve Curve
    The curve where the instance is based.
symbol FamilySymbol
    A FamilySymbol object that represents the type of the instance that is to be inserted.
level Level
    A Level object that is used as the base level for the object.
structuralType StructuralType
     If structural then specify the type of the component.

#### Return Value

FamilyInstanceIf creation was successful then an instance to the new object is returned, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the family symbol does not exist in the given document. |
| ArgumentException | Thrown if the level does not exist in the given document. |
| ArgumentException | Thrown if The symbol is not active. |

This method is used to insert one family instance into another element along the geometry of a curve. If the instance fails to be created an exception may be thrown.

The type/symbol that is used must be loaded into the document before this method is called. Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.

The host object must be one that supports insertion of instances otherwise this method will fail. All levels within the document can be found by iterating over the entire document and searching for objects of type Autodesk.Revit.Elements.Level.

Note: if the created family instance includes nested instances, the API framework will automatically regenerate the document during this method call.

#### Reference

Document Class

NewFamilyInstance Overload

Autodesk.Revit.Creation Namespace